# GetRuleDescription Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PerformanceAdviser..::..GetRuleDescription Method
PerformanceAdviser Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetRuleDescription(Int32) | Retrieves the description of the rule. |
| GetRuleDescription(PerformanceAdviserRuleId) | Retrieves the description of the rule. |

# See Also
PerformanceAdviser Class
PerformanceAdviser Members
Autodesk.Revit.DB Namespace